//=============================================================================
//

//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

/*******************************************************************************
* 構造体定義
*******************************************************************************/

// マウススキル発動用引数
enum
{
	SET_SKILL_RIGHTSHOT,// 右向きにウェーブを発生するスキルのセット
	SET_SKILL_LEFTSHOT,	// 左向きにウェーブを発生するスキルのセット
	SET_SKILL_UPSHOT,	// 上向きにウェーブを発生するスキルのセット
	SET_SKILL_DOWNSHOT,	// 下向きにウェーブを発生するスキルのセット
	SET_SKILL_CROSS,	// クロスして拡大するスキルのセット
	SET_SKILL_STUN,		// 当たった敵をスタン状態にするスキルのセット
	SET_SKILL_HOMING,	// 敵をホーミングするスキルのセット
	SET_SKILL_VORTEX,	// 敵を吸い込むスキルのセット
	SET_SKILL_MAX
};


struct	CURSOR					// カーソルの構造体
{
	D3DXVECTOR3		pos;		// 座標
	BOOL			use;		// true:使っている  false:未使用

};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitCursor(void);
void UninitCursor(void);
void UpdateCursor(void);
void DrawCursor(void);

BOOL CheckCursorPos(float x, float y, float w, float h);
void MouseSkillSet();