//=============================================================================
//

//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define ENEMY_MAX		(256)		// エネミーのMax人数


//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct ENEMY
{
	D3DXVECTOR3		pos;			// ポリゴンの座標
	D3DXVECTOR3		rot;			// ポリゴンの回転量
	D3DXVECTOR3		scl;			// ポリゴンの拡大率
	BOOL			use;			// true:使っている  false:未使用
	float			w, h;			// 幅と高さ
	int				countAnim;		// アニメーションカウント
	int				patternAnim;	// アニメーションパターンナンバー
	int				texNo;			// テクスチャ番号
	int				countBullet;	// 弾を撃つ用のカウント
	int				countMax;		// 球を撃つ間隔
	
	D3DXVECTOR3		move;			// 移動速度

	INTERPOLATION_DATA	*tblAdr;			// アニメデータのテーブル先頭アドレス
	int					tblSize;			// 登録したテーブルのレコード総数
	float				moveTime;			// 実行時間

};



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitEnemy(void);
void UninitEnemy(void);
void UpdateEnemy(void);
void DrawEnemy(void);

ENEMY *GetEnemy(void);
void SetEnemy(void);
void DestroyEnemy(int i);