//=============================================================================
//
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define ITEM_MAX		(10)		// アイテムの数


//*****************************************************************************
// 構造体定義
//*****************************************************************************
enum
{// アイテムの順番
	E_ITEM_HP,
	E_ITEM_SHIELD,
	E_ITEM_MOVESPEED_UP,
	E_ITEM_BULLETSPEED_UP,
	E_ITEM_MAX
};

struct ITEM
{
	D3DXVECTOR3		pos;			// ポリゴンの座標
	D3DXVECTOR3		rot;			// ポリゴンの回転量
	D3DXVECTOR3		scl;			// ポリゴンの拡大率
	D3DXVECTOR3		move;			// 移動速度
	BOOL			display;		// true:表示	  false:非表示
	float			w, h;			// 幅と高さ
	int				countAnim;		// アニメーションカウント
	int				patternAnim;	// アニメーションパターンナンバー
	int				texNo;			// テクスチャ番号
	int				tblSize;		// 登録したテーブルのレコード総数
	float			moveTime;		// 実行時間
	int				type;			// アイテムの種類


	INTERPOLATION_DATA	*tblAdr;	// アニメデータのテーブル先頭アドレス


};



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitItem(void);
void UninitItem(void);
void UpdateItem(void);
void DrawItem(void);

ITEM *GetItem(void);



