//=============================================================================
//
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MOUSEDRAW_MAX	(100)	// マウス描画のMax数

// マウス描画構造体
struct MOUSEDRAW
{
	D3DXVECTOR3				pos;		// マウス描画の座標
	BOOL					use;		// true:使っている  false:未使用
	float					w, h;		// 幅と高さ
	int						texNo;		// 何番目のテクスチャーを使用するのか
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitMouseDraw(void);
void UninitMouseDraw(void);
void UpdateMouseDraw(void);
void DrawMouseDraw(void);

MOUSEDRAW *GetMouseDraw(void);
void SetMouseDraw(D3DXVECTOR3 pos);


