//=============================================================================
//
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define P_BULLET_MAX		(1)		// 弾のMax数


//*****************************************************************************
// 構造体定義
//*****************************************************************************

struct P_BULLET
{
	D3DXVECTOR3		pos;			// ポリゴンの座標
	D3DXVECTOR3		rot;			// ポリゴンの回転量
	BOOL			use;			// true:使っている  false:未使用
	D3DXVECTOR3		move;			// 移動速度
	float			w, h;			// 幅と高さ
	float			countAnim;		// アニメーションカウント
	int				patternAnim;	// アニメーションパターンナンバー
	int				texNo;			// テクスチャ番号
	float			upSpeed;			// スピードアップ
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitPlayerBullet(void);
void UninitPlayerBullet(void);
void UpdatePlayerBullet(void);
void DrawPlayerBullet(void);

P_BULLET *GetPlayerBullet(void);

void SetPlayerBullet(D3DXVECTOR3 pos, int type);


