//=============================================================================
//
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

struct UI
{
	D3DXVECTOR3		pos;		// ポリゴンの座標
	D3DXCOLOR		color;
	float			w, h;		// 幅と高さ
	int				texNo;		// 使用しているテクスチャ番号
	bool			use;
};

enum
{
	ICON,
	BAR,
	UI_MAX
};
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitUI(void);
void UninitUI(void);
void UpdateUI(void);
void DrawUI(void);

void GameStartAnimation(void);
void SelectMenu(void);


