//=============================================================================
//
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define VIBRATION_MAX		(1)		// 揺れのMax数


//*****************************************************************************
// 構造体定義
//*****************************************************************************

struct VIBRATION
{
	D3DXVECTOR3		pos;			// ポリゴンの座標
	BOOL			use;			// true:使っている  false:未使用
	float			w, h;			// 幅と高さ
	float			countAnim;		// アニメーションカウント
	int				texNo;			// テクスチャ番号
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitVibration(void);
void UninitVibration(void);
void UpdateVibration(void);
void DrawVibration(void);

VIBRATION *GetVibration(void);

void SetVibration();


